{"reviews":[{"id":"PRR_kwDOPTaGFc7k03xj","author":{"login":"copilot-pull-request-reviewer"},"authorAssociation":"NONE","body":"## Pull request overview\n\nThis PR synchronizes the BNF grammar specification with the actual parser implementation and introduces the first automated test suite for the Sigil compiler. The changes align with issue #4, addressing mismatches between the documented grammar and parser behavior without introducing breaking changes to the language.\n\n**Changes:**\n- Restructured BNF to use direct recursion for expressions, eliminating unnecessary intermediate productions\n- Added support for string literals, decorators, and `.gesture` member access in BNF\n- Removed colon separator support for named call arguments (standardized on `=`)\n- Fixed broken STRING regex in lexer that incorrectly handled quote matching\n- Added proper exit codes (return 1) for parse and validation failures\n- Introduced bash test script with 8 test cases covering core parser features\n\n### Reviewed changes\n\nCopilot reviewed 13 out of 13 changed files in this pull request and generated 3 comments.\n\n<details>\n<summary>Show a summary per file</summary>\n\n| File | Description |\r\n| ---- | ----------- |\r\n| grammar/sigil.bnf | Updated BNF to accurately reflect parser's recursive structure, added missing features (strings, decorators, dot-gesture), removed unused intermediate productions, standardized identifier tokens |\r\n| compiler/sigil.y | Added support for empty parameter lists `()`, removed colon separator for named arguments |\r\n| compiler/sigil.l | Corrected STRING token regex from broken pattern to proper alternation of single/double quoted strings |\r\n| compiler/compiler.c | Added non-zero exit codes for parse and semantic validation failures |\r\n| compiler/tests/test_parser.sh | New bash test runner with 8 test cases validating parser behavior for declarations, literals, decorators, named arguments, and expressions |\r\n| compiler/tests/fragments/*.sigil | Test fragment files generated by test script, covering basic functionality |\n</details>\n\n\n\n\n\n\n---\n\n💡 <a href=\"/jbatte47/sigil/new/main/.github/instructions?filename=*.instructions.md\" class=\"Link--inTextBlock\" target=\"_blank\" rel=\"noopener noreferrer\">Add Copilot custom instructions</a> for smarter, more guided reviews. <a href=\"https://docs.github.com/en/copilot/customizing-copilot/adding-repository-custom-instructions-for-github-copilot\" class=\"Link--inTextBlock\" target=\"_blank\" rel=\"noopener noreferrer\">Learn how to get started</a>.","submittedAt":"2026-02-23T04:06:49Z","includesCreatedEdit":false,"reactionGroups":[],"state":"COMMENTED","commit":{"oid":"6adf91d2ac5559f6a312c6e1b88c8e53e0ba3550"}}]}
